init.org
#+title Emacs configuration
#+PROPERTY: header-args:emacs-lisp :tangle init.el

* packages
** straight
   #+begin_src emacs-lisp
     ;; instructions from the straight README
     (defvar bootstrap-version)
     (let ((bootstrap-file
	    (expand-file-name
	     "straight/repos/straight.el/bootstrap.el"
	     (or (bound-and-true-p straight-base-dir)
		 user-emacs-directory)))
	   (bootstrap-version 7))
       (unless (file-exists-p bootstrap-file)
	 (with-current-buffer
	     (url-retrieve-synchronously
	      "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
	      'silent 'inhibit-cookies)
	   (goto-char (point-max))
	   (eval-print-last-sexp)))
       (load bootstrap-file nil 'nomessage))

     (setq straight-use-package-by-default t)
     (straight-use-package 'use-package)
   #+end_src
** dired (deactivated)

   # With two dired-buffer copy will by default guess that we
   # want to copy to the other buffer.
   # #+begin_src emacs-lisp
   #   (defun ms/dired-mode-setup()
   #     (setq dired-dwim-target t))
   #   (add-hook 'dired-mode-hook 'ms/dired-mode-setup)
   # #+end_src
   
** evil (vim-keys)

   #+begin_src emacs-lisp
     (use-package evil
       :init
       ;; needed by evil-collection
       (setq evil-want-integration t)
       (setq evil-want-keybinding nil)
       :config
       ;; otherwise SPC SPC will not bring up M-x if for instance
       ;; a region is highlighted
       (define-key evil-motion-state-map " " nil)
       (evil-mode 1))

     ;; need to also have movement keys hjkl in some other packages like magit
     (use-package evil-collection
       :after evil
       :ensure t
       :config
       (evil-collection-init))

     ;; Prefer to use 'kj' to go back to normal mode
     (use-package evil-escape
       :config
       (evil-escape-mode)
       (setq-default evil-escape-key-sequence "kj"))
   #+end_src

** org
   #+begin_src emacs-lisp
     (use-package org
       ;; :bind
       ;; (:map org-agenda-mode-map
       ;; 	("j" . org-agenda-next-line)
       ;; 	("k" . org-agenda-previous-line))
       :config
       (setq org-M-RET-may-split-line nil)
       (setq org-insert-heading-respect-content t)
       (setq org-agenda-files (directory-files "~/syncthing/orgfiles" 1 "org$"))
       (setq org-log-done "time")
       (setq org-todo-keywords '((sequence "TODO(t)" "CONT(c)" "WAIT(w)" "REMINDER(r)" "FLEETING(f)" "|" "DONE(d)" "ABORTED(a)")))
       (setq org-log-note-headings '((done . "CLOSING NOTE %t")
     				(state . "State %-12s from %-12S %t")
     				;; (note . "Note taken on %t")
     				(note . "%d")
     				(reschedule . "Rescheduled from %S on %t")
     				(delschedule . "Not scheduled, was %S on %t")
     				(redeadline . "New deadline from %S on %t")
     				(deldeadline . "Removed deadline, was %S on %t")
     				(refile . "Refiled on %t")
     				(clock-out . "")))
       (setq org-capture-templates
     	'(("f"                    ; ← shortcut key
     	   "Fleeting note with region" ; ← description shown in the capture menu
     	   entry                  ; ← type of item (plain text, entry, etc.)
     	   (file+headline "~/syncthing/orgfiles/20251218T150014--fleeting-notes__general.org" "Inbox")
     	   "* FLEETING %u: %? %t\n  #+begin_src\n%i\n#+end_src\n origin: file:%F")
     	  ("p"                    ; ← shortcut key
     	   "Fleeting note plain"        ; ← description shown in the capture menu
     	   entry                  ; ← type of item (plain text, entry, etc.)
     	   (file+headline "~/syncthing/orgfiles/20251218T150014--fleeting-notes__general.org" "Inbox")
     	   "* FLEETING %u: %? %t\norigin: file:%F")))
       (setq org-confirm-babel-evaluate
           (lambda (lang body)
             (not (string= lang "python")))))
     (with-eval-after-load 'org
       (org-babel-do-load-languages
        'org-babel-load-languages
        '((python . t))))

     (define-key evil-motion-state-map (kbd "SPC o a") 'org-agenda)
     (define-key evil-motion-state-map (kbd "SPC o i") 'org-indent-mode)
     (define-key evil-motion-state-map (kbd "SPC o f") 'org-cycle)
     (define-key evil-motion-state-map (kbd "SPC o c") 'org-toggle-checkbox)
     (define-key evil-motion-state-map (kbd "SPC o s") 'org-save-all-org-buffers)
     (define-key evil-motion-state-map (kbd "SPC o h") 'org-toggle-heading)
     (define-key evil-motion-state-map (kbd "SPC n s") 'org-narrow-to-subtree)
     (define-key evil-motion-state-map (kbd "SPC n w") 'widen)
     (define-key evil-motion-state-map (kbd "SPC n t") 'org-show-todo-tree)
     (define-key evil-motion-state-map (kbd "SPC o n r") (lambda () (interactive) (org-capture nil "f")))
     (define-key evil-motion-state-map (kbd "SPC o n p") (lambda () (interactive) (org-capture nil "p")))
     (eval-after-load "org-agenda"
       '(progn
          (define-key org-agenda-mode-map "j" 'org-agenda-next-line)
          (define-key org-agenda-mode-map "k" 'org-agenda-previous-line)))
   #+end_src

** vertico (minibuffer)

   #+begin_src emacs-lisp
     (use-package vertico
       :init
       (vertico-mode)
       :config
       (keymap-set vertico-map "C-f" #'vertico-scroll-up)
       (keymap-set vertico-map "C-b" #'vertico-scroll-down)
       (setq vertico-cycle t))
   #+end_src

** marginali (minibuffer)

   #+begin_src emacs-lisp
     (use-package marginalia
       :init
       (marginalia-mode))
   #+end_src

** corfu (completion)

   #+begin_src emacs-lisp
     (use-package corfu
       ;; Optional customizations
       :custom
       (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
       (corfu-auto nil)               ;; Disable auto completion because typing fast seems to collide with that
                                      ;; because sometimes the whole file get manipulated?!?!
       (corfu-auto-prefix 1)
       (corfu-auto-delay 0.3)
       :hook (eshell-mode . (lambda ()
     			 (keymap-set corfu-map "RET" #'corfu-send)))
       :bind (:map corfu-map
     	      ("ö" . corfu-insert-separator))
       :init
       (global-corfu-mode))

     (use-package corfu-terminal
       :unless (display-graphic-p)
       :config
       (corfu-terminal-mode +1))

     (use-package emacs
       :custom
       ;; TAB cycle if there are only few candidates
       ;; (completion-cycle-threshold 3)
       ;; Enable indentation+completion using the TAB key.
       ;; `completion-at-point' is often bound to M-TAB.
       (tab-always-indent 'complete)

       ;; ;; Emacs 28 and newer: Hide commands in M-x which do not apply to the current
       ;; ;; mode.  Corfu commands are hidden, since they are not used via M-x. This
       ;; ;; setting is useful beyond Corfu.
       (read-extended-command-predicate #'command-completion-default-include-p))
   #+end_src
** orderless (filter results)

   #+begin_src emacs-lisp
     (use-package orderless
       :custom
       (completion-styles '(orderless basic)))
   #+end_src
** consult (preview buffer, search, ...)

   #+begin_src emacs-lisp
     (use-package consult
       :bind (("C-s" . consult-line))) ;; search
    (defun ms/consult-line-symbol-at-point ()
        "Search for a line matching the symbol found near point."
        (interactive)
        (consult-line
         (or (thing-at-point 'symbol))))
    (defun ms/consult-line-last-search ()
        "Search for a line matching the symbol used during last search."
        (interactive)
        (consult-line
         (or (car consult--line-history))))
    (define-key evil-motion-state-map (kbd "SPC f p") 'ms/consult-line-symbol-at-point)
    (define-key evil-motion-state-map (kbd "SPC f l") 'ms/consult-line-last-search)
    (define-key evil-motion-state-map (kbd "SPC f s") 'consult-line)
   #+end_src

** ivy (deactivated use vertico, marginalia, orderless and consult)

# Improve search functionalities in buffers
#    #+begin_src emacs-lisp
#      (use-package swiper
#        :bind 
#        ("C-s" . swiper))
#    #+end_src

# Fuzzy search for commands and files in minibuffer
#    #+begin_src emacs-lisp
#      (use-package ivy
#        :config
#        (setq ivy-count-format "(%d/%d)")
#        (ivy-mode 1))
#    #+End_src

# provides enhanced versions of common emacs commands
#    #+begin_src emacs-lisp
#      (use-package counsel
#        :bind (
# 	      ("M-x" . counsel-M-x)
# 	      ("C-h f" . counsel-describe-function)
# 	      ("C-h v" . counsel-describe-variable)))
#    #+End_src
   
# Shows shortcuts behind commands and additional
# descriptive text in minibuffer
#    #+begin_src emacs-lisp
#      (use-package ivy-rich
#        :init
#        (ivy-rich-mode 1))
#    #+End_src
** which-key (minibuffer incomplete commands)

Shows which keys are possible for incomplete entered
commands
   #+begin_src emacs-lisp
     (use-package which-key
       :config
       (which-key-mode))
   #+end_src

** rainbow-delimiters (deactivated)

# Coloring of parentheses, brackets and braces for different
# depth levels.
#    #+begin_src emacs-lisp
#      (use-package rainbow-delimiters
#        :hook (prog-mode . rainbow-delimiters-mode))
#    #+end_src

** helpful (more elisp help information) combined with elisp-demos to show examples in help-buffer

   #+begin_src emacs-lisp
     (use-package helpful
       :custom (counsel-describe-function-function #'helpful-callable)
       :bind ([remap describe-function] . #'helpful-callable))
     (use-package elisp-demos)
     (advice-add 'helpful-update :after #'elisp-demos-advice-helpful-update)
   #+end_src
   
