init.org
** project.el

   #+begin_src emacs-lisp
     (defun ms/save-buffer-and-recompile ()
       "Saves the current buffer and runs project-recompile"
       (interactive)
       (progn
         (save-buffer)
         (project-recompile)))
     (define-key evil-motion-state-map (kbd "SPC p s r") 'consult-ripgrep)
     (define-key evil-motion-state-map (kbd "SPC p c") 'project-compile)
     (define-key evil-motion-state-map (kbd "SPC p r") 'ms/save-buffer-and-recompile)
     (define-key evil-motion-state-map (kbd "SPC p p") 'project-switch-project)
     (define-key evil-motion-state-map (kbd "SPC p k") 'project-kill-buffers)
     (define-key evil-motion-state-map (kbd "SPC p b") 'consult-project-buffer)
     (define-key evil-motion-state-map (kbd "SPC p f") 'project-find-file)
     (define-key evil-motion-state-map (kbd "SPC p e") 'project-eshell)
     (setq project-vc-extra-root-markers '(".project.el"))
   #+end_src


# provides enhanced versions of common projectile commands like
# "jump to file"
#    #+begin_src emacs-lisp
#      (use-package counsel-projectile
#        :config (counsel-projectile-mode))
#    #+end_src

** git
*** magit (client)
   #+begin_src emacs-lisp
     (use-package magit)
     (define-key evil-motion-state-map (kbd "SPC g g") 'magit-status)
     (define-key evil-motion-state-map (kbd "SPC g b") 'magit-blame)
     (define-key evil-motion-state-map (kbd "SPC g d") 'magit-diff-dwim)

     (defun ms/generate-git-commit-msg ()
       "Generate a commit message using git diff and a python script."
       (interactive)
       (let ((diff-file "/tmp/git-diff")
             (msg-file "/tmp/commit-msg"))
         ;; print diff-file
         (shell-command (format "git diff --staged > %s" diff-file))
         (shell-command (format "cd /home/m/.emacs.d/dspy-commit && uv run main.py %s %s" diff-file msg-file))
         (if (file-exists-p msg-file)
             (insert-file-contents msg-file)
           (message "Error: %s not found" msg-file))))
     (define-key evil-motion-state-map (kbd "SPC g m") 'ms/generate-git-commit-msg)
   #+end_src
*** diff-hl

Highlights which part differ from HEAD.

   #+begin_src emacs-lisp
     (use-package diff-hl
       :config (global-diff-hl-mode))
   #+end_src
  
*** commit-messages

Allows to show the commit-message corresponding to the
line the cursor is in as a popup and also show the
parent-commits from there on.

   #+begin_src emacs-lisp
     (use-package git-messenger
       :config (setq git-messenger:show-detail t))
   #+end_src

** lsp (ide-functionality)

Language server protocol client allows to connect to 
various language servers for instance for python or R.
   #+begin_src emacs-lisp
     (use-package lsp-mode
       ;; code also comes from https://github.com/minad/corfu/wiki#basic-example-configuration-with-orderless
       :custom
       (lsp-completion-provider :none) ;; we use Corfu!
       :init
       (setq lsp-keymap-prefix "C-c l")
       (setq xref-auto-jump-to-first-definition nil) ;; necessary in older emacs for "find-definition"-functionality
       (defun my/lsp-mode-setup-completion ()
     	 (setf (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
     	       '(orderless))) ;; Configure orderless
       :hook
       (lsp-completion-mode . my/lsp-mode-setup-completion)
       :config
       (lsp-enable-which-key-integration t)
       (setq read-process-output-max (* 2 1024 1024))
       (setq gc-cons-threshold (* 2 800000))
       (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\venv\\'")
       (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\.venv\\'")
       (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\.cache\\'")
       (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\.poetry\\'")
       (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\.metaflow\\'")
       (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\.local\\'"))

     (define-key evil-motion-state-map (kbd "SPC l d") 'lsp-describe-thing-at-point)
     (define-key evil-motion-state-map (kbd "SPC l r") 'lsp-rename)
     (define-key evil-motion-state-map (kbd "SPC l f") 'lsp-find-definition)
     (define-key evil-motion-state-map (kbd "SPC l u") 'lsp-find-references)
     (define-key evil-motion-state-map (kbd "SPC l c") 'comment-or-uncomment-region)

     ;; Enables "pop-up's" with additional information about
     ;; the current symbol or documentation for functions, etc.
     (use-package lsp-ui
       :hook (lsp-mode . lsp-ui-mode))

     (use-package lsp-pyright
       :ensure t
       :hook (python-mode . (lambda ()
     			 (require 'lsp-pyright)
     			 (lsp))))  ; or lsp-deferred
   #+end_src

** flycheck

# Online linting of source code
   #+begin_src emacs-lisp
     (use-package flycheck)
   #+end_src

Text completion 
# ** company-mode (deactivated use vertico and orderless)
#    #+begin_src emacs-lisp
#         (use-package company
#           :after lsp-mode
#           :hook (lsp-mode . company-mode)
#           :custom
#           (company-minimum-prefix-length 1)
#           (company-show-numbers t)
#           (company-frontends '(company-pseudo-tooltip-frontend company-preview-frontend))
#           (company-idle-delay 0.0))
#    #+end_src

** prescient (deactivated)

# Sorts commands based on frequence of usage
#    #+begin_src emacs-lisp
#      (use-package ivy-prescient
#        :after counsel
#        :config (ivy-prescient-mode))
#    #+end_src

** ace-jump

Jump around by specifying a sequence of chars (avy) or
first char of a word (ace-jump)
   #+begin_src emacs-lisp
     (use-package ace-jump-mode
       :config
       (define-key evil-motion-state-map (kbd "SPC s") 'ace-jump-word-mode))
   #+end_src

** winner (deactivated)

# Switch through layouts from the history
#    #+begin_src emacs-lisp
#      (use-package winner
#        :config (winner-mode)
#        :bind (
# 	      :map evil-window-map
# 	      ("p" . winner-undo)
# 	      ("n" . winner-redo)))
#    #+end_src

** yasnippet (deactivated)

# Provides snippet functionality
#    #+begin_src emacs-lisp
#      (use-package yasnippet
#        :config
#        (yas-reload-all)
#        :hook
#        (python-mode . yas-minor-mode)
#        (ess-mode . yas-minor-mode)
#        (org-mode . yas-minor-mode))
#    #+end_src


# Various snippets
#    #+begin_src emacs-lisp
#      (use-package yasnippet-snippets)
#    #+end_src
** temple
  Copy paste from https://github.com/minad/tempel?tab=readme-ov-file#configuration
#+begin_src emacs-lisp
  (use-package tempel
    ;; Require trigger prefix before template name when completing.
    ;; :custom
    ;; (tempel-trigger-prefix "<")

    ;; :bind (("M-+" . tempel-complete) ;; Alternative tempel-expand
    ;;        ("M-*" . tempel-insert))

    :init
    ;; Setup completion at point
    (defun tempel-setup-capf ()
      ;; Add the Tempel Capf to `completion-at-point-functions'.
      ;; `tempel-expand' only triggers on exact matches. Alternatively use
      ;; `tempel-complete' if you want to see all matches, but then you
      ;; should also configure `tempel-trigger-prefix', such that Tempel
      ;; does not trigger too often when you don't expect it. NOTE: We add
      ;; `tempel-expand' *before* the main programming mode Capf, such
      ;; that it will be tried first.
      (setq-local completion-at-point-functions
  		(cons #'tempel-expand
  		      (remove #'tempel-expand completion-at-point-functions))))

    ;; (add-hook 'conf-mode-hook 'tempel-setup-capf)
    (add-hook 'lsp-completion-mode-hook 'tempel-setup-capf)
    (add-hook 'text-mode-hook 'tempel-setup-capf)
    (add-hook 'eshell-mode-hook 'tempel-setup-capf)

    ;; Optionally make the Tempel templates available to Abbrev,
    ;; either locally or globally. `expand-abbrev' is bound to C-x '.
    ;; (add-hook 'prog-mode-hook #'tempel-abbrev-mode)
    ;; (global-tempel-abbrev-mode)
  )
#+end_src
** symon (deactivated)

# Systemmonitor in the minibuffer

#    #+begin_src emacs-lisp
#      (use-package symon
#        :config
#        (setq symon-delay 5)
#        (symon-mode))
#    #+end_src

** beacon

Cursor highlighting after switch windows

   #+begin_src emacs-lisp
     (use-package beacon
       :config
       (beacon-mode 1)
       (setq beacon-blink-duration 2))
   #+end_src

** indent-guide

Provides vertical lines from the beginning to the end
of a 'indentation-level' the cursor is in.

   #+begin_src emacs-lisp
     (use-package indent-guide
       :config (indent-guide-global-mode))
   #+end_src

** docker (deactivated)
   # #+begin_src emacs-lisp
   #   (use-package docker
   #     :ensure t
   #     :bind ("C-c d" . docker)
   #     :config (setq docker-run-as-root t))
   # #+end_src

** format-all (deactivated)
   
#    #+begin_src emacs-lisp
#      (use-package format-all
#        :config (add-hook 'prog-mode-hook 'format-all-mode))
#    #+end_src
** anzu (deactivated)

# Visible query-replace
#    #+begin_src emacs-lisp
#      (use-package anzu
#        :config (global-anzu-mode +1))
#    #+end_src
** yaml
   #+begin_src emacs-lisp
     (use-package yaml-mode
       :config (add-to-list 'auto-mode-alist '("\\.yml\\'" . yaml-mode)))
   #+end_src
** denote

   #+begin_src emacs-lisp
     (use-package denote
       :config
       (setq denote-journal-extras-title-format 'year-month-day)
       (setq denote-directory "~/syncthing/orgfiles"))
   #+end_src
** goto-last-change

   #+begin_src emacs-lisp
     (use-package goto-last-change)
   #+end_src

** gptel

   #+begin_src emacs-lisp
     (use-package gptel
       :config
       ;; (setq gptel--debug t)
       ;; (setq gptel-log-level 'debug)
       (setq gptel-default-mode #'org-mode)
       (setq gptel-org-branching-context t)
       (setq gptel-temperature 0.0)
       (global-set-key (kbd "C-c C-<return>") 'gptel-send)
       (add-to-list 'gptel-directives '(explain . "Explain the code to a novice programmer"))
       (gptel-make-ollama "Ollama"
         :host "localhost:11434"
         :stream t
         :models '(codellama:7b))
       (setq gptel-model   'google/gemini-3-flash-preview
     	gptel-backend
     	(gptel-make-openai "OpenRouter"               ;Any name you want
     	  :host "openrouter.ai"
     	  :endpoint "/api/v1/chat/completions"
     	  :stream t
     	  :key (getenv "OPENROUTER_API_KEY")
     	  :models '(mistralai/mistral-small-3.2-24b-instruct
     		    google/gemini-3-flash-preview
     		    minimax/minimax-m2.1
     		    minimax/minimax-m2.5
     		    openai/gpt-oss-120b))))
     (define-key evil-motion-state-map (kbd "SPC a c") 'gptel)
     (define-key evil-motion-state-map (kbd "SPC a m") 'gptel-menu)
   #+end_src
