init.el
  :config (projectile-mode))
(define-key evil-motion-state-map (kbd "SPC p") 'projectile-command-map)
;; need to define keybinding for consult after the projectile commands
;; because SPC p is already referring to projectile-command-map
(define-key evil-motion-state-map (kbd "SPC p s r") 'consult-ripgrep)

(use-package magit)
(define-key evil-motion-state-map (kbd "SPC g g") 'magit-status)
(define-key evil-motion-state-map (kbd "SPC g b") 'magit-blame)
(define-key evil-motion-state-map (kbd "SPC g d") 'magit-diff-dwim)

(use-package diff-hl
  :config (global-diff-hl-mode))

(use-package git-messenger
  :config (setq git-messenger:show-detail t))

(use-package lsp-mode
  ;; code also comes from https://github.com/minad/corfu/wiki#basic-example-configuration-with-orderless
  :custom
  (lsp-completion-provider :none) ;; we use Corfu!
  :init
  (setq lsp-keymap-prefix "C-c l")
  (setq xref-auto-jump-to-first-definition nil) ;; necessary in older emacs for "find-definition"-functionality
  (defun my/lsp-mode-setup-completion ()
	 (setf (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
	       '(orderless))) ;; Configure orderless
  :hook
  (lsp-completion-mode . my/lsp-mode-setup-completion)
  :config
  (lsp-enable-which-key-integration t)
  (setq read-process-output-max (* 2 1024 1024))
  (setq gc-cons-threshold (* 2 800000))
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\venv\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\.venv\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\.cache\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\.poetry\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\.metaflow\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\.local\\'"))

(define-key evil-motion-state-map (kbd "SPC l d") 'lsp-describe-thing-at-point)
(define-key evil-motion-state-map (kbd "SPC l r") 'lsp-rename)
(define-key evil-motion-state-map (kbd "SPC l f") 'lsp-find-definition)
(define-key evil-motion-state-map (kbd "SPC l u") 'lsp-find-references)
(define-key evil-motion-state-map (kbd "SPC l c") 'comment-or-uncomment-region)

;; Enables "pop-up's" with additional information about
;; the current symbol or documentation for functions, etc.
(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode))

(use-package lsp-pyright
  :ensure t
  :hook (python-mode . (lambda ()
			 (require 'lsp-pyright)
			 (lsp))))  ; or lsp-deferred

(use-package ace-jump-mode
  :config
  (define-key evil-motion-state-map (kbd "SPC s") 'ace-jump-word-mode))

(use-package tempel
  ;; Require trigger prefix before template name when completing.
  ;; :custom
  ;; (tempel-trigger-prefix "<")

  ;; :bind (("M-+" . tempel-complete) ;; Alternative tempel-expand
  ;;        ("M-*" . tempel-insert))

  :init
  ;; Setup completion at point
  (defun tempel-setup-capf ()
    ;; Add the Tempel Capf to `completion-at-point-functions'.
    ;; `tempel-expand' only triggers on exact matches. Alternatively use
    ;; `tempel-complete' if you want to see all matches, but then you
    ;; should also configure `tempel-trigger-prefix', such that Tempel
    ;; does not trigger too often when you don't expect it. NOTE: We add
    ;; `tempel-expand' *before* the main programming mode Capf, such
    ;; that it will be tried first.
    (setq-local completion-at-point-functions
		(cons #'tempel-expand
		      (remove #'tempel-expand completion-at-point-functions))))

  ;; (add-hook 'conf-mode-hook 'tempel-setup-capf)
  (add-hook 'lsp-completion-mode-hook 'tempel-setup-capf)
  (add-hook 'text-mode-hook 'tempel-setup-capf)

  ;; Optionally make the Tempel templates available to Abbrev,
  ;; either locally or globally. `expand-abbrev' is bound to C-x '.
  ;; (add-hook 'prog-mode-hook #'tempel-abbrev-mode)
  ;; (global-tempel-abbrev-mode)
)

(use-package beacon
  :config
  (beacon-mode 1)
  (setq beacon-blink-duration 2))

(use-package indent-guide
  :config (indent-guide-global-mode))

(use-package yaml-mode
  :config (add-to-list 'auto-mode-alist '("\\.yml\\'" . yaml-mode)))

(use-package denote
  :config
  (setq denote-journal-extras-title-format 'year-month-day)
  (setq denote-directory "~/syncthing/orgfiles"))

(use-package goto-last-change)

(use-package gptel
  :config
  ;; (setq gptel--debug t)
  ;; (setq gptel-log-level 'debug)
  (setq gptel-default-mode #'org-mode)
  (setq gptel-org-branching-context t)
  (setq gptel-temperature 0.0)
  (global-set-key (kbd "C-c C-<return>") 'gptel-send)
  (add-to-list 'gptel-directives '(explain . "Explain the code to a novice programmer"))
  (gptel-make-ollama "Ollama"
    :host "localhost:11434"
    :stream t
    :models '(codellama:7b))
  (setq gptel-model   'mistralai/mistral-small-3.2-24b-instruct
      gptel-backend
      (gptel-make-openai "OpenRouter"               ;Any name you want
        :host "openrouter.ai"
        :endpoint "/api/v1/chat/completions"
        :stream t
        :key (getenv "OPENROUTER_API_KEY")
        :models '(mistralai/mistral-small-3.2-24b-instruct
		  openai/gpt-oss-120b))))
(define-key evil-motion-state-map (kbd "SPC a c") 'gptel)
(define-key evil-motion-state-map (kbd "SPC a m") 'gptel-menu)
