init.org
** ragmacs
#+begin_src emacs-lisp
  (use-package ragmacs
     :ensure t
     :straight (:host github :repo "positron-solutions/ragmacs")
     :after gptel
     :defer
     :init
     (gptel-make-preset 'introspect
       :pre (lambda () (require 'ragmacs))
       :system
       "You are pair programming with the user in Emacs and on Emacs.

   Your job is to dive into Elisp code and understand the APIs and
   structure of elisp libraries and Emacs.  Use the provided tools to do
   so, but do not make duplicate tool calls for information already
   available in the chat.

   <tone>
   1. Be terse and to the point.  Speak directly.
   2. Explain your reasoning.
   3. Do NOT hedge or qualify.
   4. If you don't know, say you don't know.
   5. Do not offer unprompted advice or clarifications.
   6. Never apologize.
   7. Do NOT summarize your answers.
   </tone>

   <code_generation>
   When generating code:
   1. Always check that functions or variables you use in your code exist.
   2. Also check their calling convention and function-arity before you use them.
   3. Write code that can be tested by evaluation, and offer to evaluate
   code using the `elisp_eval` tool.
   </code_generation>

   <formatting>
   1. When referring to code symbols (variables, functions, tags etc) enclose them in markdown quotes.
      Examples: `read_file`, `getResponse(url, callback)`
      Example: `<details>...</details>`
   2. If you use LaTeX notation, enclose math in \( and \), or \[ and \] delimiters.
   </formatting>"
       :tools '("introspection")))
#+end_src
** llm-functions
   #+begin_src emacs-lisp
     (defun ollama-only-code-curl-to-buffer (text)
       "Send TEXT to a buffer with the name BUFFER-NAME."
       (let ((curl-command (format "curl -s -X POST http://ollama:11434/api/generate -d '{ \"model\": \"codellama:7b\",\"prompt\": \"%s. only code\", \"stream\": false }' " (replace-regexp-in-string "\n" " " text))))
         (with-current-buffer (get-buffer-create "curl-llm-out")
           (erase-buffer)
           (insert (shell-command-to-string curl-command)))))

     (defun extract-json-response ()
       "Extract the 'response' field from a JSON buffer and save it to a new buffer."
       (with-current-buffer  (get-buffer "curl-llm-out")
         (let* ((json-string (buffer-string))
     	   (json-data (json-read-from-string json-string))
     	   (response (cdr (assoc 'response json-data))))
           (concat "\n---------------------llm-start---------------------\n" response "\n---------------------llm-end---------------------\n")
           )))

     (defun llm-minibuffer (text)
       (interactive "sOllama: ")
       (ollama-only-code-curl-to-buffer text)
       (let ((response (extract-json-response)))
         (insert response))
       )

     (defun llm-only-code ()
       "Returns the text selected by a region."
       (interactive)
       (let ((region (buffer-substring (region-beginning) (region-end))))
         (llm-minibuffer region)))
   #+end_src
** undo-tree

   #+begin_src emacs-lisp
     (use-package undo-tree
       :config
       (global-undo-tree-mode)
       (setq undo-tree-auto-save-history nil))
   #+end_src

** expand-region

   #+begin_src emacs-lisp
     (use-package expand-region)
     (define-key evil-motion-state-map (kbd "e") 'er/expand-region)
   #+end_src

** embark

   #+begin_src emacs-lisp
     (use-package embark
       :bind(:map minibuffer-local-map
     	     ("C-c C-c" . embark-collect)))
     (use-package embark-consult)
   #+end_src

** evil-snipe

   #+begin_src emacs-lisp
     (use-package evil-snipe
       :config (evil-snipe-mode))
   #+end_src

** evil-visualstar

   #+begin_src emacs-lisp
     (use-package evil-visualstar
       :config
       (global-evil-visualstar-mode)
       (setq evil-visualstar/persistent 1))
   #+end_src

** aidermacs (deactivated)
# #+begin_src emacs-lisp
#   (use-package aidermacs
#     :config
#     (setenv "OLLAMA_API_BASE" "http://192.168.1.10:11434")
#     :custom
#     (aidermacs-default-chat-mode 'architect)
#     (aidermacs-default-model "openrouter/mistralai/mistral-small-3.2-24b-instruct"))
#   (define-key evil-motion-state-map (kbd "SPC a") 'aidermacs-transient-menu)
#   (setq ediff-split-window-function 'split-window-vertically)
# #+end_src
** eca
#+begin_src emacs-lisp
  (use-package eca
    :ensure t
    :straight (:host github :repo "editor-code-assistant/eca-emacs" :files ("*.el")))
  ;; (setq eca-extra-args '("--verbose" "--log-level" "debug"))
  (define-key evil-motion-state-map (kbd "SPC a e") 'eca-chat-toggle-window)
  (define-key evil-motion-state-map (kbd "SPC a r") 'eca-restart)
  (define-key evil-motion-state-map (kbd "SPC a s") 'eca-stop)
  (defun ms/eca-rewrite-google-docstrings ()
    "Rewrite text with Google-style docstrings using eca-rewrite."
    (interactive)
    (eca-rewrite "add/update docstrings following google-style. Dont update the code itself!"))
  (define-key evil-motion-state-map (kbd "SPC a w d") #'ms/eca-rewrite-google-docstrings)
    (defun ms/eca-rewrite-by-inline-comments ()
      "Rewrite code based on inline comments using eca-rewrite."
      (interactive)
      (eca-rewrite "follow the instructions closely given by `# AI:`. In case of multiple lines marked with `# AI:` follow the instructions that are most important for the functionality of the code."))
  (define-key evil-motion-state-map (kbd "SPC a w i") #'ms/eca-rewrite-by-inline-comments)
    (defun ms/eca-rewrite-add-implementation-shortcomings ()
      "Add shortcomings in the implementation to the code marked with `# AI:` using eca-rewrite"
      (interactive)
      (eca-rewrite "Add comments to the code about shortcomings in the implementation. Dont update the code itself. Focus on shortcomings that could lead to bugs or maintenance issues. Make the comments short and concise. Add them in a separate line directly above the code they refer to and start the comment with `# AI:`."))
  (define-key evil-motion-state-map (kbd "SPC a w s") #'ms/eca-rewrite-add-implementation-shortcomings)
  (define-key evil-motion-state-map (kbd "SPC a w r") 'eca-rewrite)
#+end_src
** minuet (inline completion)
#+begin_src emacs-lisp
  (use-package minuet
      :bind
      (("M-y" . #'minuet-complete-with-minibuffer) ;; use minibuffer for completion
       ("M-i" . #'minuet-show-suggestion) ;; use overlay for completion
       :map minuet-active-mode-map
       ;; These keymaps activate only when a minuet suggestion is displayed in the current buffer
       ("M-p" . #'minuet-previous-suggestion) ;; invoke completion or cycle to next completion
       ("M-n" . #'minuet-next-suggestion) ;; invoke completion or cycle to previous completion
       ("M-A" . #'minuet-accept-suggestion) ;; accept whole completion
       ;; Accept the first line of completion, or N lines with a numeric-prefix:
       ;; e.g. C-u 2 M-a will accepts 2 lines of completion.
       ("M-a" . #'minuet-accept-suggestion-line)
       ("M-e" . #'minuet-dismiss-suggestion))

      ;; :init
      ;; ;; if you want to enable auto suggestion.
      ;; ;; Note that you can manually invoke completions without enable minuet-auto-suggestion-mode
      ;; (add-hook 'prog-mode-hook #'minuet-auto-suggestion-mode)

      :config
      (setq minuet-provider 'openai-compatible)
      (setq minuet-request-timeout 2.5)
      (setq minuet-auto-suggestion-throttle-delay 1.5) ;; Increase to reduce costs and avoid rate limits
      (setq minuet-auto-suggestion-debounce-delay 0.6) ;; Increase to reduce costs and avoid rate limits

      (plist-put minuet-openai-compatible-options :end-point "https://openrouter.ai/api/v1/chat/completions")
      (plist-put minuet-openai-compatible-options :api-key (defun fetch_key () (getenv "OPENROUTER_API_KEY")))
      (plist-put minuet-openai-compatible-options :model "qwen/qwen3-coder")


      ;; Prioritize throughput for faster completion
      (minuet-set-optional-options minuet-openai-compatible-options :provider '(:sort "throughput"))
      (minuet-set-optional-options minuet-openai-compatible-options :max_tokens 56)
      (minuet-set-optional-options minuet-openai-compatible-options :top_p 0.9))
#+end_src
* own packages
** time table
#+begin_src emacs-lisp

  (use-package time-table
    :straight (time-table :type git :host github :repo "MarselScheer/time-table" :branch "time-table-buffer")
    :custom
    (time-table-work-hours 0)
    (time-table-file "~/syncthing/orgfiles/tracked-times")
    (time-table-project-names '("book" "kg" "time-table" "emacs" "backup" "end"))
    (time-table-task-names '("code" "tex" "math" "end")))
  (define-key evil-motion-state-map (kbd "SPC t t") 'time-table-track)
  (define-key evil-motion-state-map (kbd "SPC t s") 'time-table-status)
  (define-key evil-motion-state-map (kbd "SPC t S") 'time-table-summarize-projects-last-7-days)
  (define-key evil-motion-state-map (kbd "SPC t b") 'time-table-find-tracking-file)
  (define-key evil-motion-state-map (kbd "SPC t e") 'time-table-end-tracking)
#+end_src
* languages
** debugging (deactivated)
   # #+begin_src emacs-lisp
   #   (use-package dap-mode
   #     :config
   #     (setq dap-auto-configure-features '(sessions locals expressions repl))
   #     (dap-auto-configure-mode))
   # #+end_src

** dockerfiles (deactivated)
   # #+begin_src emacs-lisp
   #   (use-package dockerfile-mode
   #     :config
   #     (add-to-list 'auto-mode-alist '("Dockerfile\\'" . dockerfile-mode)))
   # #+end_src
   
