init.el

(use-package ragmacs
   :ensure t
   :straight (:host github :repo "positron-solutions/ragmacs")
   :after gptel
   :defer
   :init
   (gptel-make-preset 'introspect
     :pre (lambda () (require 'ragmacs))
     :system
     "You are pair programming with the user in Emacs and on Emacs.

 Your job is to dive into Elisp code and understand the APIs and
 structure of elisp libraries and Emacs.  Use the provided tools to do
 so, but do not make duplicate tool calls for information already
 available in the chat.

 <tone>
 1. Be terse and to the point.  Speak directly.
 2. Explain your reasoning.
 3. Do NOT hedge or qualify.
 4. If you don't know, say you don't know.
 5. Do not offer unprompted advice or clarifications.
 6. Never apologize.
 7. Do NOT summarize your answers.
 </tone>

 <code_generation>
 When generating code:
 1. Always check that functions or variables you use in your code exist.
 2. Also check their calling convention and function-arity before you use them.
 3. Write code that can be tested by evaluation, and offer to evaluate
 code using the `elisp_eval` tool.
 </code_generation>

 <formatting>
 1. When referring to code symbols (variables, functions, tags etc) enclose them in markdown quotes.
    Examples: `read_file`, `getResponse(url, callback)`
    Example: `<details>...</details>`
 2. If you use LaTeX notation, enclose math in \( and \), or \[ and \] delimiters.
 </formatting>"
     :tools '("introspection")))

(defun ollama-only-code-curl-to-buffer (text)
  "Send TEXT to a buffer with the name BUFFER-NAME."
  (let ((curl-command (format "curl -s -X POST http://ollama:11434/api/generate -d '{ \"model\": \"codellama:7b\",\"prompt\": \"%s. only code\", \"stream\": false }' " (replace-regexp-in-string "\n" " " text))))
    (with-current-buffer (get-buffer-create "curl-llm-out")
      (erase-buffer)
      (insert (shell-command-to-string curl-command)))))

(defun extract-json-response ()
  "Extract the 'response' field from a JSON buffer and save it to a new buffer."
  (with-current-buffer  (get-buffer "curl-llm-out")
    (let* ((json-string (buffer-string))
	   (json-data (json-read-from-string json-string))
	   (response (cdr (assoc 'response json-data))))
      (concat "\n---------------------llm-start---------------------\n" response "\n---------------------llm-end---------------------\n")
      )))

(defun llm-minibuffer (text)
  (interactive "sOllama: ")
  (ollama-only-code-curl-to-buffer text)
  (let ((response (extract-json-response)))
    (insert response))
  )

(defun llm-only-code ()
  "Returns the text selected by a region."
  (interactive)
  (let ((region (buffer-substring (region-beginning) (region-end))))
    (llm-minibuffer region)))

(use-package undo-tree
  :config
  (global-undo-tree-mode)
  (setq undo-tree-auto-save-history nil))

(use-package expand-region)
(define-key evil-motion-state-map (kbd "e") 'er/expand-region)

(use-package embark
  :bind(:map minibuffer-local-map
	     ("C-c C-c" . embark-collect)))
(use-package embark-consult)

(use-package evil-snipe
  :config (evil-snipe-mode))

(use-package evil-visualstar
  :config
  (global-evil-visualstar-mode)
  (setq evil-visualstar/persistent 1))

;; (use-package aidermacs
;;   :config
;;   (setenv "OLLAMA_API_BASE" "http://192.168.1.10:11434")
;;   :custom
;;   (aidermacs-default-chat-mode 'architect)
;;   (aidermacs-default-model "openrouter/mistralai/mistral-small-3.2-24b-instruct"))
;; (define-key evil-motion-state-map (kbd "SPC a") 'aidermacs-transient-menu)
;; (setq ediff-split-window-function 'split-window-vertically)

(use-package eca
  :ensure t
  :straight (:host github :repo "editor-code-assistant/eca-emacs" :files ("*.el")))
;; (setq eca-extra-args '("--verbose" "--log-level" "debug"))
(define-key evil-motion-state-map (kbd "SPC a e") 'eca)
(define-key evil-motion-state-map (kbd "SPC a r") 'eca-restart)

(use-package time-table
  :straight (time-table :type git :host github :repo "MarselScheer/time-table" :branch "time-table-buffer")
  :custom
  (time-table-work-hours 0)
  (time-table-file "~/syncthing/orgfiles/tracked-times")
  (time-table-project-names '("book" "kg" "time-table" "emacs" "backup" "end"))
  (time-table-task-names '("code" "tex" "math" "end")))
(define-key evil-motion-state-map (kbd "SPC t t") 'time-table-track)
(define-key evil-motion-state-map (kbd "SPC t s") 'time-table-status)
(define-key evil-motion-state-map (kbd "SPC t S") 'time-table-summarize-projects-last-7-days)
(define-key evil-motion-state-map (kbd "SPC t b") 'time-table-find-tracking-file)
(define-key evil-motion-state-map (kbd "SPC t e") 'time-table-end-tracking)
