init.org
** python
   # #+begin_src emacs-lisp
   #   (defun ms/py-execute-buffer ()
   #     "Saves projects and sends buffer"
   #     (interactive)
   #     (when (get-buffer "*Python*")
   #       (let ((kill-buffer-query-functions nil))
   #         (kill-buffer "*Python*")))
   #     (projectile-save-project-buffers)
   #     (py-execute-buffer)
   #     (let ((my-window (get-buffer-window)))
   #       (ivy--switch-buffer-other-window-action "*Python*")
   #       (select-window my-window)))

   #   (defun ms/py-execute-class ()
   #     "Saves projects and sends class"
   #     (interactive)
   #     (projectile-save-project-buffers)
   #     (py-execute-class))

   #   (defun ms/py-execute-region (beg end)
   #     "Saves projects and sends region"
   #     (interactive "r")
   #     (projectile-save-project-buffers)
   #     (py-execute-region beg end))
   # #+end_src
   # #+begin_src emacs-lisp
   #   (use-package flymake-ruff)
   #   (add-hook 'python-mode-hook #'flymake-ruff-load)
   # #+end_src

   #+begin_src emacs-lisp
     (use-package ruff-format)
     (add-hook 'python-mode-hook 'ruff-format-on-save-mode)
   #+end_src

   #+begin_src emacs-lisp
     ;; in order to configure the built-in python mode use
     ;; (use-package python)
     ;; (use-package python-mode
     ;;   :hook (python-mode . (lambda ()
     ;; 			 (define-key python-mode-map (kbd "TAB") 'completion-at-point)
     ;; 			 (lsp-deferred))))
       ;; :config
       ;; ;; (require 'dap-python)
       ;; (evil-define-key 'normal 'python-mode-map (kbd "SPC r i") 'py-switch-to-shell)
       ;; ;; (evil-define-key 'normal 'python-mode-map (kbd "SPC r b") 'ms/py-execute-buffer)
       ;; ;; (evil-define-key 'normal 'python-mode-map (kbd "SPC r c") 'ms/py-execute-class)
       ;; ;; (evil-define-key 'normal 'python-mode-map (kbd "SPC r r") 'ms/py-execute-region)
       ;; (setq py-split-window-on-execute nil))
       ;; ;; (setq dap-python-debugger 'debugpy)
     ;; (define-key python-mode-map (kbd "TAB") 'completion-at-point)

     (setq python-shell-interpreter "uv")
     (setq python-shell-interpreter-args "run python -i")
   #+end_src

** R (deactivated)
*** ess
   # #+begin_src emacs-lisp
   #   (defun show-R-buffer ()
   #     (switch-to-buffer-other-window
   # 	(buffer-name
   # 	 (car
   # 	  (seq-filter
   # 	   (lambda (b) (string-prefix-p "*R:" (buffer-name b)))
   # 	   (buffer-list)))))
   #     (switch-to-buffer-other-window (other-buffer (current-buffer) 1)))

   #   (defun ess-pkgdown-site ()
   #     "Interface to tinytest"
   #     (interactive)
   #     (projectile-save-project-buffers)
   #     (ess-eval-linewise
   # 	"roxygen2::roxygenize(); options(pkgdown.internet = FALSE); pkgdown::build_site(preview = FALSE)"
   # 	"Build pkgdown site"))

   #   (defun ess-pkgdown-articles ()
   #     "Interface to tinytest"
   #     (interactive)
   #     (projectile-save-project-buffers)
   #     (ess-eval-linewise
   # 	"roxygen2::roxygenize(); options(pkgdown.internet = FALSE); pkgdown::build_articles(preview = FALSE)"
   # 	"Build pkgdown articles"))

   #   (setq ms/default-test-file nil)
   #   (setq ms/default-test-dir nil)

   #   (defun ess-r-tinytest-file (file)
   #     "Interface to tinytest"
   #     (interactive (list (read-file-name "Select test file:" ms/default-test-dir nil nil ms/default-test-file)))
   #     (setq ms/default-test-dir (concat (f-dirname file) "/"))
   #     (setq ms/default-test-file (f-filename file))
   #     (projectile-save-project-buffers)
   #     (ess-r-package-eval-linewise
   # 	(format "pkgload::load_all(); tinytest::run_test_file('%s')" file)
   # 	"Load package. Run test file"))

   #   (defun ess-r-tinytest ()
   #     "Interface to tinytest"
   #     (interactive)
   #     (projectile-save-project-buffers)
   #     (ess-r-package-eval-linewise
   # 	"pkgload::load_all(); tinytest::test_all()"
   # 	"Load package. Test with tinytest"))

   #   (defun ess-print-at-point ()
   #     "print of whats at point"
   #     (interactive)
   #     (let ((target (thing-at-point 'symbol)))
   # 	 (ess-eval-linewise
   # 	  (format "%s" target)
   # 	  (format "Print instance: %s" target)))
   #     (show-R-buffer))

   #   (defun ess-head-at-point ()
   #     "prints head of whats at point"
   #     (interactive)
   #     (let ((target (thing-at-point 'symbol)))
   # 	 (ess-eval-linewise
   # 	  (format "head(%s)" target)
   # 	  (format "Head of instance: %s" target)))
   #     (show-R-buffer))

   #   (defun ess-tail-at-point ()
   #     "prints tail of whats at point"
   #     (interactive)
   #     (let ((target (thing-at-point 'symbol)))
   # 	 (ess-eval-linewise
   # 	  (format "tail(%s)" target)
   # 	  (format "Tail of instance: %s" target))))

   #   (defun drake-load-at-point ()
   #     "load drake-target at point"
   #     (interactive)
   #     (let ((target (thing-at-point 'symbol)))
   # 	 (ess-eval-linewise
   # 	  (format "drake::loadd(%s)" target)
   # 	  (format "Load target: %s" target)))
   #     (show-R-buffer))

   #   (defun drake-load-at-point-and-print ()
   #     "load drake-target at point and print"
   #     (interactive)
   #     (drake-load-at-point)
   #     (ess-print-at-point)
   #     (show-R-buffer))

   #   (defun drake-load-at-point-and-head ()
   #     "load drake-target at point and print head"
   #     (interactive)
   #     (drake-load-at-point)
   #     (ess-head-at-point)
   #     (show-R-buffer))

   #   (defun drake-prep-run ()
   #     "prep drake run"
   #     (interactive)
   #     (projectile-save-project-buffers)
   #     (ess-eval-linewise
   # 	"source('prep_drake_run.R')"
   # 	"Prepare next drake run")
   #     (show-R-buffer))

   #   (defun drake-exec-run ()
   #     "execute drake run"
   #     (interactive)
   #     (projectile-save-project-buffers)
   #     (ess-eval-linewise
   # 	"execute_plans(confirm = FALSE)"
   # 	"Execute drake run")
   #     (show-R-buffer))
   # #+end_src

   # #+begin_src emacs-lisp
   #   (use-package ess
   #     :hook (ess-mode . lsp-deferred)
   #     :config
   #     (setq-default ess-style 'RStudio-)
   #     (evil-define-key 'insert 'ess-r-mode-map (kbd "C-p") 'company-manual-begin)
   #     (evil-define-key 'normal 'ess-r-mode-map (kbd "SPC d p") 'drake-prep-run)
   #     (evil-define-key 'normal 'ess-r-mode-map (kbd "SPC d r") 'drake-exec-run)
   #     (evil-define-key 'normal 'ess-r-mode-map (kbd "SPC d l") 'drake-load-at-point)
   #     (evil-define-key 'normal 'ess-r-mode-map (kbd "SPC r d a") 'ess-pkgdown-articles)
   #     (evil-define-key 'normal 'ess-r-mode-map (kbd "SPC r d s") 'ess-pkgdown-site)
   #     (evil-define-key 'normal 'ess-r-mode-map (kbd "SPC r b") 'ess-eval-buffer)
   #     (evil-define-key 'normal 'ess-r-mode-map (kbd "SPC r s") 'ess-eval-buffer-from-beg-to-here)
   #     (evil-define-key 'normal 'ess-r-mode-map (kbd "SPC r e") 'ess-eval-buffer-from-here-to-end)
   #     (evil-define-key 'normal 'ess-r-mode-map (kbd "SPC r r") 'ess-eval-region-or-function-or-paragraph)
   #     (evil-define-key 'normal 'ess-r-mode-map (kbd "SPC r k") 'ess-head-at-point)
   #     (evil-define-key 'normal 'ess-r-mode-map (kbd "SPC r j") 'ess-tail-at-point)
   #     (evil-define-key 'normal 'ess-r-mode-map (kbd "SPC r p") 'ess-print-at-point)
   #     (evil-define-key 'normal 'ess-r-mode-map (kbd "SPC r t") 'ess-r-tinytest-file)
   #     (evil-define-key 'normal 'ess-r-mode-map (kbd "SPC p P") 'ess-r-tinytest)
   #     (setq ess-eval-visibly 't))
   # #+end_src

*** poly-R-markdown

Polymode for working with Rmd-files

   # #+begin_src emacs-lisp
   #   (use-package poly-R
   #     :ensure t)
   # #+end_src

* General key bindings.
** Copied from https://github.com/emacs-evil/evil-collection
   #+begin_src emacs-lisp
     (defvar my-intercept-mode-map (make-sparse-keymap)
       "High precedence keymap.")

     (define-minor-mode my-intercept-mode
       "Global minor mode for higher precedence evil keybindings."
       :global t)

     (my-intercept-mode)

     (dolist (state '(normal visual insert))
       (evil-make-intercept-map
	;; NOTE: This requires an evil version from 2018-03-20 or later
	(evil-get-auxiliary-keymap my-intercept-mode-map state t t)
	state))

     (evil-define-key 'normal my-intercept-mode-map
       (kbd "SPC SPC") 'execute-extended-command)
     (evil-define-key 'normal my-intercept-mode-map
       (kbd "SPC b f") 'find-file)
     (evil-define-key 'normal my-intercept-mode-map
       (kbd "SPC b b") 'consult-buffer)
     (evil-define-key 'normal my-intercept-mode-map
       (kbd "SPC b k") 'kill-buffer)
     (evil-define-key 'normal my-intercept-mode-map
       (kbd "SPC b o") 'consult-buffer-other-window)
     (evil-define-key 'normal my-intercept-mode-map
       (kbd "SPC w") 'evil-window-map)
   #+end_src
 ** bookmarks
 #+begin_src emacs-lisp
   (define-key evil-motion-state-map (kbd "SPC m s") 'bookmark-set)
   (define-key evil-motion-state-map (kbd "SPC m j") 'bookmark-jump)
   (define-key evil-motion-state-map (kbd "SPC m J") 'bookmark-jump-other-window)
#+end_src

* ui
** general
*** Visual wrap prefix (indent wrapped lines appropriately)
    #+begin_src emacs-lisp
      (global-visual-line-mode 1)
      (global-visual-wrap-prefix-mode 1)
    #+end_src
*** Remove various UI-elements
#+begin_src emacs-lisp
     (setq inhibit-startup-screen t)
     (scroll-bar-mode -1)
     (tool-bar-mode -1)
     (menu-bar-mode -1)
     (tooltip-mode -1)
   #+end_src

*** Show always end of compilation buffer or first error
   #+begin_src emacs-lisp
     (custom-set-variables
      ;; custom-set-variables was added by Custom.
      ;; If you edit it by hand, you could mess it up, so be careful.
      ;; Your init file should contain only one such instance.
      ;; If there is more than one, they won't work right.
      '(compilation-scroll-output 'first-error)
      '(warning-suppress-log-types '((native-compiler))))
   #+end_src

*** Add additional UI-info
   #+begin_src emacs-lisp
     (column-number-mode)
     (global-display-line-numbers-mode t)
     (setq display-line-numbers-type 'relative)
     (savehist-mode 1)
   #+end_src

** Compilation buffer
   #+begin_src emacs-lisp
     (use-package fancy-compilation
       :commands (fancy-compilation-mode))
     (with-eval-after-load 'compile
       (fancy-compilation-mode))
  #+end_src
- necessary to interpret color statements in compilation buffer like =echo -e "\033[33mstart\033[0m"=. However, =fancy-compilation= does this out of the box
   # #+begin_src emacs-lisp
   #   (require 'ansi-color)
   #   (defun colorize-compilation-buffer ()
   #     (ansi-color-apply-on-region compilation-filter-start (point-max)))
   #   (add-hook 'compilation-filter-hook 'colorize-compilation-buffer)
   # #+end_src


** theme
   #+begin_src emacs-lisp
     (use-package doom-themes)
     (load-theme 'doom-dracula t)
     ;; (use-package cyberpunk-theme)
     ;; (load-theme 'cyberpunk t)
     ;; (consult-theme 'deeper-blue)
     (custom-set-faces
      ;; custom-set-faces was added by Custom.
      ;; If you edit it by hand, you could mess it up, so be careful.
      ;; Your init file should contain only one such instance.
      ;; If there is more than one, they won't work right.
      '(ivy-current-match ((t (:extend t :background "gray10" :foreground "yellow" :box nil :weight bold)))))
   #+end_src

   #+begin_src emacs-lisp
     ;; (use-package doom-modeline
     ;;  :init (doom-modeline-mode 0))
     (use-package telephone-line)
     (telephone-line-mode 1)
   #+end_src
   
* Emacs native config
** backup
   #+begin_src emacs-lisp
     (setq backup-directory-alist `(("." . ,(expand-file-name "tmp/backups/" user-emacs-directory))))
     (setq delete-old-versions t)
     (setq version-control t)
     (setq kept-new-versions 7)
   #+end_src
