init.el

(use-package flymake-ruff)
(add-hook 'python-mode-hook #'flymake-ruff-load)

(use-package ruff-format)
(add-hook 'python-mode-hook 'ruff-format-on-save-mode)

(use-package python-mode
  :hook (python-mode . (lambda ()
			 (define-key python-mode-map (kbd "TAB") 'completion-at-point)
			 (lsp-deferred))))
  ;; :config
  ;; ;; (require 'dap-python)
  ;; (evil-define-key 'normal 'python-mode-map (kbd "SPC r i") 'py-switch-to-shell)
  ;; ;; (evil-define-key 'normal 'python-mode-map (kbd "SPC r b") 'ms/py-execute-buffer)
  ;; ;; (evil-define-key 'normal 'python-mode-map (kbd "SPC r c") 'ms/py-execute-class)
  ;; ;; (evil-define-key 'normal 'python-mode-map (kbd "SPC r r") 'ms/py-execute-region)
  ;; (setq py-split-window-on-execute nil))
  ;; ;; (setq dap-python-debugger 'debugpy)
;; (define-key python-mode-map (kbd "TAB") 'completion-at-point)

(setq python-shell-interpreter "uv")
(setq python-shell-interpreter-args "run python -i")

(defvar my-intercept-mode-map (make-sparse-keymap)
  "High precedence keymap.")

(define-minor-mode my-intercept-mode
  "Global minor mode for higher precedence evil keybindings."
  :global t)

(my-intercept-mode)

(dolist (state '(normal visual insert))
  (evil-make-intercept-map
	;; NOTE: This requires an evil version from 2018-03-20 or later
	(evil-get-auxiliary-keymap my-intercept-mode-map state t t)
	state))

(evil-define-key 'normal my-intercept-mode-map
  (kbd "SPC SPC") 'execute-extended-command)
(evil-define-key 'normal my-intercept-mode-map
  (kbd "SPC b f") 'find-file)
(evil-define-key 'normal my-intercept-mode-map
  (kbd "SPC b b") 'consult-buffer)
(evil-define-key 'normal my-intercept-mode-map
  (kbd "SPC b k") 'kill-buffer)
(evil-define-key 'normal my-intercept-mode-map
  (kbd "SPC b o") 'consult-buffer-other-window)
(evil-define-key 'normal my-intercept-mode-map
  (kbd "SPC w") 'evil-window-map)

(define-key evil-motion-state-map (kbd "SPC m s") 'bookmark-set)
(define-key evil-motion-state-map (kbd "SPC m j") 'bookmark-jump)
(define-key evil-motion-state-map (kbd "SPC m J") 'bookmark-jump-other-window)

(global-visual-line-mode 1)
(global-visual-wrap-prefix-mode 1)

(setq inhibit-startup-screen t)
(scroll-bar-mode -1)
(tool-bar-mode -1)
(menu-bar-mode -1)
(tooltip-mode -1)

(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(compilation-scroll-output 'first-error)
 '(warning-suppress-log-types '((native-compiler))))

(column-number-mode)
(global-display-line-numbers-mode t)
(setq display-line-numbers-type 'relative)
(savehist-mode 1)

(require 'ansi-color)
(defun colorize-compilation-buffer ()
  (ansi-color-apply-on-region compilation-filter-start (point-max)))
(add-hook 'compilation-filter-hook 'colorize-compilation-buffer)

(use-package doom-themes)
(load-theme 'doom-dracula t)
;; (use-package cyberpunk-theme)
;; (load-theme 'cyberpunk t)
;; (consult-theme 'deeper-blue)
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(ivy-current-match ((t (:extend t :background "gray10" :foreground "yellow" :box nil :weight bold)))))

;; (use-package doom-modeline
;;  :init (doom-modeline-mode 0))
(use-package telephone-line)
(telephone-line-mode 1)

(setq backup-directory-alist `(("." . ,(expand-file-name "tmp/backups/" user-emacs-directory))))
(setq delete-old-versions t)
(setq version-control t)
(setq kept-new-versions 7)
